In [ ]:
############# pandas 1강 - pandas의 고유한 자료구조 - Series

In [113]:
import pandas as pd
import numpy as np

In [114]:
obj = pd.Series([4,7,-5,3])

In [115]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [116]:
obj.values

array([ 4,  7, -5,  3])

In [117]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [118]:
obj.dtype

dtype('int64')

In [120]:
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c'])

In [121]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [123]:
sdata = {"charles":35000, "kilho":71000, "asdasd":160000, "woncheol":99999}
obj3 = pd.Series(sdata)

In [124]:
obj3

asdasd      160000
charles      35000
kilho        71000
woncheol     99999
dtype: int64

In [128]:
obj3.name = "Salary"
obj3.index.name = "Namesssssss"
obj3

Namesssssss
asdasd      160000
charles      35000
kilho        71000
woncheol     99999
Name: Salary, dtype: int64

In [129]:
obj3.index=["A","BB","CCC","DDDD"]

In [130]:
obj3

A       160000
BB       35000
CCC      71000
DDDD     99999
Name: Salary, dtype: int64

In [132]:
data = {"names":["kilho","kilho","kilho","woncheol","woncheol"],
       "year":[2014,2015,2016,2017,2016],
       "point":[1.5,1.7,3.5,2.5,6.6]}
df=pd.DataFrame(data)
df

      names  point  year
0     kilho    1.5  2014
1     kilho    1.7  2015
2     kilho    3.5  2016
3  woncheol    2.5  2017
4  woncheol    6.6  2016

In [133]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [134]:
df.columns

Index(['names', 'point', 'year'], dtype='object')

In [135]:
df.values

array([['kilho', 1.5, 2014],
       ['kilho', 1.7, 2015],
       ['kilho', 3.5, 2016],
       ['woncheol', 2.5, 2017],
       ['woncheol', 6.6, 2016]], dtype=object)

In [136]:
df.index.name = "num"
df.columns.name = "info"
df

info     names  point  year
num
0        kilho    1.5  2014
1        kilho    1.7  2015
2        kilho    3.5  2016
3     woncheol    2.5  2017
4     woncheol    6.6  2016

In [140]:
df2 = pd.DataFrame(data, columns=["year","names","point","penalty"],
                           index=["one","two","three","four","five"])
df2

       year     names  point penalty
one    2014     kilho    1.5     NaN
two    2015     kilho    1.7     NaN
three  2016     kilho    3.5     NaN
four   2017  woncheol    2.5     NaN
five   2016  woncheol    6.6     NaN

In [142]:
df2.columns

Index(['year', 'names', 'point', 'penalty'], dtype='object')

In [143]:
df2.values

array([[2014, 'kilho', 1.5, nan],
       [2015, 'kilho', 1.7, nan],
       [2016, 'kilho', 3.5, nan],
       [2017, 'woncheol', 2.5, nan],
       [2016, 'woncheol', 6.6, nan]], dtype=object)

In [145]:
df2.describe()

              year    point
count     5.000000  5.00000
mean   2015.600000  3.16000
std       1.140175  2.07798
min    2014.000000  1.50000
25%    2015.000000  1.70000
50%    2016.000000  2.50000
75%    2016.000000  3.50000
max    2017.000000  6.60000

In [146]:
df2.describe

<bound method NDFrame.describe of        year     names  point penalty
one    2014     kilho    1.5     NaN
two    2015     kilho    1.7     NaN
three  2016     kilho    3.5     NaN
four   2017  woncheol    2.5     NaN
five   2016  woncheol    6.6     NaN>